files/collections/PMAK-68ba2ba23093ae0001f335c5-6ac1ba92c75a29f896e9dfcec3ef2ebefe/11-11-2025/8748389-PO Attachments.json

{"collection":{"info":{"_postman_id":"392952f2-ef6c-4645-b40d-b041ffc88b65","name":"PO Attachments","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json","updatedAt":"2020-11-19T04:00:13.000Z","createdAt":"2020-11-19T00:05:14.000Z","lastUpdatedBy":"8748389","uid":"8748389-392952f2-ef6c-4645-b40d-b041ffc88b65"},"item":[{"name":"{{ServerName}}//fscmService/ErpObjectAttachmentService","id":"45fd1688-49d8-4817-9bf9-a3671720bd2e","protocolProfileBehavior":{"disabledSystemHeaders":{"content-type":true},"disableBodyPruning":true},"request":{"auth":{"type":"basic","basic":[{"key":"username","value":"{{Username}}","type":"string"},{"key":"password","value":"{{Password}}","type":"string"}]},"method":"POST","header":[{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <ns1:uploadAttachment xmlns:ns1=\"http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/types/\">\r\n            <ns1:entityName>PO_HEADERS</ns1:entityName>\r\n            <ns1:categoryName>TO_SUPPLIER</ns1:categoryName>\r\n            <ns1:allowDuplicate>yes</ns1:allowDuplicate>\r\n            <ns1:attachmentRows xmlns:ns2=\"http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/\">\r\n                <ns2:UserKeyA>164082</ns2:UserKeyA>\r\n                <ns2:UserKeyB>US1 Legal Entity</ns2:UserKeyB>\r\n                <ns2:UserKeyC>#NULL</ns2:UserKeyC>\r\n                <ns2:UserKeyD>#NULL</ns2:UserKeyD>\r\n                <ns2:UserKeyE>#NULL</ns2:UserKeyE>\r\n                <ns2:AttachmentType>TEXT</ns2:AttachmentType>\r\n                <ns2:Title>Sample Title</ns2:Title>\r\n                <ns2:Content>Urgent Approval</ns2:Content>\r\n            </ns1:attachmentRows>\r\n        </ns1:uploadAttachment>\r\n    </soap:Body>\r\n</soap:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{ServerName}}/fscmService/ErpObjectAttachmentService","host":["{{ServerName}}"],"path":["fscmService","ErpObjectAttachmentService"],"query":[{"key":"WSDL","value":null,"disabled":true}]},"description":"PO Attachments"},"response":[],"uid":"8748389-45fd1688-49d8-4817-9bf9-a3671720bd2e"}]}}